{
  "_meta": {
    "maxChars": {
      "enterTheCode": 400,
      "of": 400,
      "next": 400,
      "ok": 400,
      "loading": 400,
      "play": 400,
      "end": 400,
      "door": 400,
      "intro_1": 400,
      "intro_2": 400,
      "intro_3": 400,
      "intro_4": 400,
      "mapaTutorial_1": 400,
      "mapaTutorial_2": 400,
      "mapaTutorial_3": 400,
      "mapaTutorial_4": 400,
      "mapaTutorial_5": 400,
      "mapaTutorial_6": 400,
      "mapaTutorial_7": 400,
      "mapaTutorial_8": 400,
      "mapaTutorial_9": 400,
      "mapaTutorial_10": 400,
      "puertaTutorial_1": 400,
      "puertaTutorial_2": 400,
      "puertaTutorial_3": 400,
      "puertaTutorialGood": 400,
      "puertaTutorialBad": 400,
      "puertaTutorial_Final": 400,
      "cofre_1": 400,
      "modulo1Tutorial_1": 400,
      "modulo1Tutorial_2": 400,
      "modulo1Tutorial_3": 400,
      "modulo1Tutorial_4": 400,
      "modulo1Tutorial_5": 400,
      "modulo1Tutorial_6": 400,
      "modulo2Tutorial_1": 400,
      "modulo12Tutorial_Bad": 400,
      "modulo12Tutorial_Good": 400,
      "modulo3Tutorial_1": 400,
      "modulo3Tutorial_2": 400,
      "modulo3Tutorial_3": 400,
      "modulo3Tutorial_4": 400,
      "modulo3Tutorial_5": 400,
      "modulo3Tutorial_Bad": 400,
      "modulo3Tutorial_Good": 400,
      "cofreFinished": 400,
      "lastChestOpen": 400,
      "treasureFinded": 400
    }
  },
  "en": {
    "enterTheCode": "Value",
    "of": "of",
    "next": "Next",
    "ok": "Ok",
    "loading": "Loading...",
    "play": "Play",
    "end": "Thank you for playing!",
    "door": "Door Opened",
    "intro_1": "I am finally on the fraction island. Here I will find the fraction treasure.",
    "intro_2": "The legend says that I have to find 4 gems to open the gate of the fraction treasure.",
    "intro_3": "I can go through the island destroying bushes pressing 'Space' key.",
    "intro_4": "To find the gem's location I will open the map clicking on the 'M' or with the 'M' key.",
    "mapaTutorial_1": "Ok! The gem's coordinates are on the left side of the screen. I will try the yellow one.",
    "mapaTutorial_2": "It shows me a red and a blue location. Let's try with the red one.",
    "mapaTutorial_3": "In this one I have to multiply 1/2 times 1/4. The answer is 1/8.",
    "mapaTutorial_4": "The blue multiplication is 3/5 times 1/2, and the answer is 3/10.",
    "mapaTutorial_5": "The legend says that the amount of red and blue lines shown on the map is the same as the denominator obtained from the multiplication.",
    "mapaTutorial_6": "In this case the red location is 1/8. That means I have to put 8 red lines using the buttons at the bottom of the screen.",
    "mapaTutorial_7": "Ok, now the 10 blue lines with the other buttons.",
    "mapaTutorial_8": "Great! I have the right amount of lines. Now click at the intersection of the first red line and the third blue line.",
    "mapaTutorial_9": "The yellow gem's location is revealed. I will go check it.",
    "mapaTutorial_10": "To close the map I can press the 'M' key again or click on the 'X' on the top right corner.",
    "puertaTutorial_1": "This door is blocking my way to the gem. I have to open it.",
    "puertaTutorial_2": "The mechanism will open when I put the right answer and click the 3 buttons.",
    "puertaTutorial_3": "Let's try with the answer of any operation and click on the button with the red circle to check.",
    "puertaTutorialGood": "That was the right answer! The answers seem to be related, so let's try the same one with the other buttons.",
    "puertaTutorialBad": "That's not quite the answer. Let's try again.",
    "puertaTutorial_Final": "I knew it; the answers were related. I can see a whole number as multiplication of a whole number by the unit fraction.",
    "cofre_1": "Finally the first gem, but it is inside the chest. Let's open it.",
    "modulo1Tutorial_1": "I can solve this writing a value on the purple fraction's numerator.",
    "modulo1Tutorial_2": "This vault has the same amount of stamps as the red fraction's denominator.",
    "modulo1Tutorial_3": "Inside of every red piece there are blue stamps and it is the same amount as the blue fraction's denominator.",
    "modulo1Tutorial_4": "This means that if I cut a piece of the lock according to the red fraction and then stamp it according to the blue fraction",
    "modulo1Tutorial_5": "I will find how to express the fraction of a fraction as a fraction times a fraction. With a look on the purple fraction's denominators I can see is the result of multiply the red and blue fraction's denominator.",
    "modulo1Tutorial_6": "I will find the answer multiplying the red and blue fraction's numerators. Let's check the answer clicking the button with the red circle.",
    "modulo2Tutorial_1": "This part is very similar to the earlier one. I will use the same idea to answer it. Let's put a value and click the button with the red circle in it.",
    "modulo12Tutorial_Good": "That was the right answer. Great!",
    "modulo12Tutorial_Bad": "It looks like that is not the answer of multiplying numerators, so let's try again.",
    "modulo3Tutorial_1": "This puzzle looks easy, blue squares on top, and red squares on left, with purple squares in the middle.",
    "modulo3Tutorial_2": " I have to put the same amount of squares as the red squares multiplied by the blue squares. Let's do it clicking on the buttons at the bottom of the screen.",
    "modulo3Tutorial_3": "Ok, looks like I have the same amount as one side, so let's get the right amount of squares on the other side.",
    "modulo3Tutorial_4": "With the perfect amount of squares. Let's turn on some squares by clicking on them.",
    "modulo3Tutorial_5": "Let's turn on the purple squares that are under the turned on blue squares and beside of the turned on red squares",
    "modulo3Tutorial_Good": "The amount of squares that I should turn on is the same as the multiplication of the blue and red turned on squares.",
    "modulo3Tutorial_Bad": "It does not seem like the right amount of turned on squares, maybe it is the multiplication of the red and blue turned on squares.",
    "cofreFinished": "I have opened the chest! The gem is free,.I just need 3 more and the treasure door will open.",
    "lastChestOpen": "I have found the last gem and a sudden earthquake happened. I will go check the treasure door.",
    "treasureFinded": "Finally found the fraction treasure!"
  }
}